lvm-bin/lvm_2.03.30_build_arm64/share/man/man8/pvscan.8
.TH PVSCAN 8 "LVM TOOLS 2.03.30(2) (2025-01-14)" "Red Hat, Inc."
.
.SH NAME
.
pvscan \(em List all physical volumes
.
.SH SYNOPSIS
.
\fBpvscan\fP \fIoption_args\fP \fIposition_args\fP
.br
    [ \fIoption_args\fP ]
.br
    [ \fIposition_args\fP ]
.br
.P
.ad l
 \fB\-a\fP|\fB\-\-activate\fP \fBy\fP|\fBn\fP|\fBay\fP
.br
 \fB\-A\fP|\fB\-\-allpvs\fP
.br
    \fB\-\-autoactivation\fP \fIString\fP
.br
    \fB\-\-cache\fP
.br
    \fB\-\-checkcomplete\fP
.br
    \fB\-\-commandprofile\fP \fIString\fP
.br
    \fB\-\-config\fP \fIString\fP
.br
 \fB\-d\fP|\fB\-\-debug\fP
.br
    \fB\-\-devices\fP \fIPV\fP
.br
    \fB\-\-devicesfile\fP \fIString\fP
.br
    \fB\-\-driverloaded\fP \fBy\fP|\fBn\fP
.br
 \fB\-e\fP|\fB\-\-exported\fP
.br
 \fB\-h\fP|\fB\-\-help\fP
.br
    \fB\-\-ignorelockingfailure\fP
.br
    \fB\-\-journal\fP \fIString\fP
.br
    \fB\-\-listlvs\fP
.br
    \fB\-\-listvg\fP
.br
    \fB\-\-lockopt\fP \fIString\fP
.br
    \fB\-\-longhelp\fP
.br
 \fB\-j\fP|\fB\-\-major\fP \fINumber\fP
.br
    \fB\-\-minor\fP \fINumber\fP
.br
    \fB\-\-nohints\fP
.br
    \fB\-\-nolocking\fP
.br
    \fB\-\-noudevsync\fP
.br
 \fB\-n\fP|\fB\-\-novolumegroup\fP
.br
    \fB\-\-profile\fP \fIString\fP
.br
 \fB\-q\fP|\fB\-\-quiet\fP
.br
    \fB\-\-reportformat\fP \fBbasic\fP|\fBjson\fP|\fBjson_std\fP
.br
 \fB\-s\fP|\fB\-\-short\fP
.br
 \fB\-t\fP|\fB\-\-test\fP
.br
    \fB\-\-udevoutput\fP
.br
 \fB\-u\fP|\fB\-\-uuid\fP
.br
 \fB\-v\fP|\fB\-\-verbose\fP
.br
    \fB\-\-version\fP
.br
    \fB\-\-vgonline\fP
.br
 \fB\-y\fP|\fB\-\-yes\fP
.ad b
.
.SH DESCRIPTION
.
When called without the \-\-cache option, pvscan lists PVs on the system,
like
.BR pvs (8)
or
.BR pvdisplay (8).
.P
When \-\-cache is used, pvscan updates runtime lvm state on the system, or
with \-aay performs autoactivation.
.P
.B pvscan \-\-cache
.I device
.P
If device is present, lvm records that the PV on device is online.
If device is not present, lvm removes the online record for the PV.
pvscan only reads the named device.
.P
.B pvscan \-\-cache
.P
Updates the runtime state for all lvm devices.
.P
.B pvscan \-\-cache \-aay
.I device
.P
Performs the \-\-cache steps for the device, then checks if the VG using the
device is complete.  If so, LVs in the VG are autoactivated, the same as
vgchange \-aay vgname would do.  (A device name may be replaced with major
and minor numbers.)
.P
.B pvscan \-\-cache \-aay
.P
Performs the \-\-cache steps for all devices, then autoactivates any complete VGs.
.P
.B pvscan \-\-cache \-\-listvg|\-\-listlvs
.I device
.P
Performs the \-\-cache steps for the device, then prints the name of the VG
using the device, or the names of LVs using the device.  \-\-checkcomplete
is usually included to check if all PVs for the VG or LVs are online.
When this command is called by a udev rule, the output must conform to
udev rule specifications (see \-\-udevoutput.)  The udev rule will use the
results to perform autoactivation.
.P
Autoactivation of VGs or LVs can be enabled/disabled using vgchange or
lvchange with \-\-setautoactivation y|n, or by adding names to
.BR lvm.conf (5)
.B activation/auto_activation_volume_list
.P
See
.BR lvmautoactivation (7)
for more information about how pvscan is used for autoactivation.
.
.SH USAGE
.
Display PV information.
.br
.P
\fBpvscan\fP
.br
.RS 4
.ad l
[ \fB\-e\fP|\fB\-\-exported\fP ]
.br
[ \fB\-n\fP|\fB\-\-novolumegroup\fP ]
.br
[ \fB\-s\fP|\fB\-\-short\fP ]
.br
[ \fB\-u\fP|\fB\-\-uuid\fP ]
.br
[ \fB\-A\fP|\fB\-\-allpvs\fP ]
.br
[    \fB\-\-ignorelockingfailure\fP ]
.br
[    \fB\-\-reportformat\fP \fBbasic\fP|\fBjson\fP|\fBjson_std\fP ]
.br
[ COMMON_OPTIONS ]
.ad b
.RE
.P
\(em
.P
Record that a PV is online or offline.
.br
.P
\fBpvscan\fP \fB\-\-cache\fP
.br
.RS 4
.ad l
[ \fB\-j\fP|\fB\-\-major\fP \fINumber\fP ]
.br
[    \fB\-\-ignorelockingfailure\fP ]
.br
[    \fB\-\-reportformat\fP \fBbasic\fP|\fBjson\fP|\fBjson_std\fP ]
.br
[    \fB\-\-minor\fP \fINumber\fP ]
.br
[    \fB\-\-noudevsync\fP ]
.br
[ COMMON_OPTIONS ]
.ad b
.RE
.RS 4
[ \fIString\fP|\fIPV\fP ... ]
.RE
.P
\(em
.P
Record that a PV is online and autoactivate the VG if complete.
.br
.P
\fBpvscan\fP \fB\-\-cache\fP \fB\-a\fP|\fB\-\-activate\fP \fBay\fP
.br
.RS 4
.ad l
[ \fB\-j\fP|\fB\-\-major\fP \fINumber\fP ]
.br
[    \fB\-\-ignorelockingfailure\fP ]
.br
[    \fB\-\-reportformat\fP \fBbasic\fP|\fBjson\fP|\fBjson_std\fP ]
.br
[    \fB\-\-minor\fP \fINumber\fP ]
.br
[    \fB\-\-noudevsync\fP ]
.br
[    \fB\-\-autoactivation\fP \fIString\fP ]
.br
[ COMMON_OPTIONS ]
.ad b
.RE
.RS 4
[ \fIString\fP|\fIPV\fP ... ]
.RE
.P
\(em
.P
Record that a PV is online and list the VG using the PV.
.br
.P
\fBpvscan\fP \fB\-\-cache\fP \fB\-\-listvg\fP \fIPV\fP
.br
.RS 4
.ad l
[    \fB\-\-ignorelockingfailure\fP ]
.br
[    \fB\-\-checkcomplete\fP ]
.br
[    \fB\-\-vgonline\fP ]
.br
[    \fB\-\-udevoutput\fP ]
.br
[    \fB\-\-autoactivation\fP \fIString\fP ]
.br
[ COMMON_OPTIONS ]
.ad b
.RE
.P
\(em
.P
Record that a PV is online and list LVs using the PV.
.br
.P
\fBpvscan\fP \fB\-\-cache\fP \fB\-\-listlvs\fP \fIPV\fP
.br
.RS 4
.ad l
[    \fB\-\-ignorelockingfailure\fP ]
.br
[    \fB\-\-checkcomplete\fP ]
.br
[    \fB\-\-vgonline\fP ]
.br
[ COMMON_OPTIONS ]
.ad b
.RE
.P
\(em
.P
List LVs using the PV.
.br
.P
\fBpvscan\fP \fB\-\-listlvs\fP \fIPV\fP
.br
.RS 4
.ad l
[ COMMON_OPTIONS ]
.ad b
.RE
.P
\(em
.P
List the VG using the PV.
.br
.P
\fBpvscan\fP \fB\-\-listvg\fP \fIPV\fP
.br
.RS 4
.ad l
[ COMMON_OPTIONS ]
.ad b
.RE
.P
\(em
.P
Common options for lvm:
.
.RS 4
.ad l
[ \fB\-d\fP|\fB\-\-debug\fP ]
.br
[ \fB\-h\fP|\fB\-\-help\fP ]
.br
[ \fB\-q\fP|\fB\-\-quiet\fP ]
.br
[ \fB\-t\fP|\fB\-\-test\fP ]
.br
[ \fB\-v\fP|\fB\-\-verbose\fP ]
.br
[ \fB\-y\fP|\fB\-\-yes\fP ]
.br
[    \fB\-\-commandprofile\fP \fIString\fP ]
.br
[    \fB\-\-config\fP \fIString\fP ]
.br
[    \fB\-\-devices\fP \fIPV\fP ]
.br
[    \fB\-\-devicesfile\fP \fIString\fP ]
.br
[    \fB\-\-driverloaded\fP \fBy\fP|\fBn\fP ]
.br
[    \fB\-\-journal\fP \fIString\fP ]
.br
[    \fB\-\-lockopt\fP \fIString\fP ]
.br
[    \fB\-\-longhelp\fP ]
.br
[    \fB\-\-nohints\fP ]
.br
[    \fB\-\-nolocking\fP ]
.br
[    \fB\-\-profile\fP \fIString\fP ]
.br
[    \fB\-\-version\fP ]
.ad b
.RE
.
.SH OPTIONS
.
.
.HP
\fB\-a\fP|\fB\-\-activate\fP \fBy\fP|\fBn\fP|\fBay\fP
.br
Auto-activate LVs in a VG when the PVs scanned have completed the VG.
(Only \fBay\fP is applicable.)
.
.HP
\fB\-A\fP|\fB\-\-allpvs\fP
.br
Show information about PVs outside the devices file.
Displays the device ID for PVs included in the devices file.
.
.HP
\fB\-\-autoactivation\fP \fIString\fP
.br
Specify if autoactivation is being used from an event.
This allows the command to apply settings that are specific
to event activation, such as device scanning optimizations
using pvs_online files created by event-based pvscans.
.
.HP
\fB\-\-cache\fP
.br
Scan one or more devices and record that they are online.
.
.HP
\fB\-\-checkcomplete\fP
.br
Check if all the devices used by a VG or LV are present,
and print "complete" or "incomplete" for each listed
VG or LV.  This option is used as a part of event-based
autoactivation, so pvscan will do nothing if this option
is set and event_activation=0 in the config settings.
.
.HP
\fB\-\-commandprofile\fP \fIString\fP
.br
The command profile to use for command configuration.
See \fBlvm.conf\fP(5) for more information about profiles.
.
.HP
\fB\-\-config\fP \fIString\fP
.br
Config settings for the command. These override \fBlvm.conf\fP(5) settings.
The String arg uses the same format as \fBlvm.conf\fP(5),
or may use section/field syntax.
See \fBlvm.conf\fP(5) for more information about config.
.
.HP
\fB\-d\fP|\fB\-\-debug\fP ...
.br
Set debug level. Repeat from 1 to 6 times to increase the detail of
messages sent to the log file and/or syslog (if configured).
.
.HP
\fB\-\-devices\fP \fIPV\fP
.br
Restricts the devices that are visible and accessible to the command.
Devices not listed will appear to be missing. This option can be
repeated, or accepts a comma separated list of devices. This overrides
the devices file.
.
.HP
\fB\-\-devicesfile\fP \fIString\fP
.br
A file listing devices that LVM should use.
The file must exist in \fI/lvm/etc/devices/\fP and is managed
with the \fBlvmdevices\fP(8) command.
This overrides the \fBlvm.conf\fP(5) \fBdevices/devicesfile\fP and
\fBdevices/use_devicesfile\fP settings.
.
.HP
\fB\-\-driverloaded\fP \fBy\fP|\fBn\fP
.br
If set to no, the command will not attempt to use device-mapper.
For testing and debugging.
.
.HP
\fB\-e\fP|\fB\-\-exported\fP
.br
Only show PVs belonging to exported VGs.
.
.HP
\fB\-h\fP|\fB\-\-help\fP
.br
Display help text.
.
.HP
\fB\-\-ignorelockingfailure\fP
.br
Allows a command to continue with read-only metadata
operations after locking failures.
.
.HP
\fB\-\-journal\fP \fIString\fP
.br
Record information in the systemd journal.
This information is in addition to information
enabled by the lvm.conf log/journal setting.
command: record information about the command.
output: record the default command output.
debug: record full command debugging.
.
.HP
\fB\-\-listlvs\fP
.br
Print a list of LVs that use the device.
.
.HP
\fB\-\-listvg\fP
.br
Print the VG that uses the device.
.
.HP
\fB\-\-lockopt\fP \fIString\fP
.br
Used to pass options for special cases to lvmlockd.
See \fBlvmlockd\fP(8) for more information.
.
.HP
\fB\-\-longhelp\fP
.br
Display long help text.
.
.HP
\fB\-j\fP|\fB\-\-major\fP \fINumber\fP
.br
The major number of a device.
.
.HP
\fB\-\-minor\fP \fINumber\fP
.br
The minor number of a device.
.
.HP
\fB\-\-nohints\fP
.br
Do not use the hints file to locate devices for PVs. A command may read
more devices to find PVs when hints are not used. The command will still
perform standard hint file invalidation where appropriate.
.
.HP
\fB\-\-nolocking\fP
.br
Disable locking. Use with caution, concurrent commands may produce
incorrect results.
.
.HP
\fB\-\-noudevsync\fP
.br
Disables udev synchronization. The process will not wait for notification
from udev. It will continue irrespective of any possible udev processing
in the background. Only use this if udev is not running or has rules that
ignore the devices LVM creates.
.
.HP
\fB\-n\fP|\fB\-\-novolumegroup\fP
.br
Only show PVs not belonging to any VG.
.
.HP
\fB\-\-profile\fP \fIString\fP
.br
An alias for \-\-commandprofile or \-\-metadataprofile, depending
on the command.
.
.HP
\fB\-q\fP|\fB\-\-quiet\fP ...
.br
Suppress output and log messages. Overrides \-\-debug and \-\-verbose.
Repeat once to also suppress any prompts with answer 'no'.
.
.HP
\fB\-\-reportformat\fP \fBbasic\fP|\fBjson\fP|\fBjson_std\fP
.br
Overrides current output format for reports which is defined globally by
the report/output_format setting in \fBlvm.conf\fP(5).
\fBbasic\fP is the original format with columns and rows.
If there is more than one report per command, each report is prefixed
with the report name for identification. \fBjson\fP produces report
output in JSON format. \fBjson_std\fP produces report output in
JSON format which is more compliant with JSON standard.
See \fBlvmreport\fP(7) for more information.
.
.HP
\fB\-s\fP|\fB\-\-short\fP
.br
Short listing format.
.
.HP
\fB\-t\fP|\fB\-\-test\fP
.br
Run in test mode. Commands will not update metadata.
This is implemented by disabling all metadata writing but nevertheless
returning success to the calling function. This may lead to unusual
error messages in multi-stage operations if a tool relies on reading
back metadata it believes has changed but hasn't.
.
.HP
\fB\-\-udevoutput\fP
.br
Command output is modified to be imported from a udev rule.
.
.HP
\fB\-u\fP|\fB\-\-uuid\fP
.br
Show UUIDs in addition to device names.
.
.HP
\fB\-v\fP|\fB\-\-verbose\fP ...
.br
Set verbose level. Repeat from 1 to 4 times to increase the detail
of messages sent to stdout and stderr.
.
.HP
\fB\-\-version\fP
.br
Display version information.
.
.HP
\fB\-\-vgonline\fP
.br
The first command to see a complete VG will report it uniquely.
Other commands to see the complete VG will report it differently.
.
.HP
\fB\-y\fP|\fB\-\-yes\fP
.br
Do not prompt for confirmation interactively but always assume the
answer yes. Use with extreme caution.
(For automatic no, see \-qq.)
.
.SH VARIABLES
.
.TP
.I PV
Physical Volume name, a device path under /dev.
For commands managing physical extents, a PV positional arg
generally accepts a suffix indicating a range (or multiple ranges)
of physical extents (PEs). When the first PE is omitted, it defaults
to the start of the device, and when the last PE is omitted it defaults to end.
Start and end range (inclusive): \fIPV\fP[\fB:\fP\fIPE\fP\fB\-\fP\fIPE\fP]...
Start and length range (counting from 0): \fIPV\fP[\fB:\fP\fIPE\fP\fB+\fP\fIPE\fP]...
.TP
.I String
See the option description for information about the string content.
.TP
.IR Size [UNIT]
Size is an input number that accepts an optional unit.
Input units are always treated as base two values, regardless of
capitalization, e.g. 'k' and 'K' both refer to 1024.
The default input unit is specified by letter, followed by |UNIT.
UNIT represents other possible input units:
.BR b | B
is bytes,
.BR s | S
is sectors of 512 bytes,
.BR k | K
is KiB,
.BR m | M
is MiB,
.BR g | G
is GiB,
.BR t | T
is TiB,
.BR p | P
is PiB,
.BR e | E
is EiB.
(This should not be confused with the output control \-\-units, where
capital letters mean multiple of 1000.)
.
.SH ENVIRONMENT VARIABLES
.
See \fBlvm\fP(8) for information about environment variables used by lvm.
For example, LVM_VG_NAME can generally be substituted for a required VG parameter.
.
.SH SEE ALSO
.
.nh
.ad l
.BR lvm (8),
.BR lvm.conf (5),
.BR lvmconfig (8),
.BR lvmdevices (8),
.P
.BR pvchange (8),
.BR pvck (8),
.BR pvcreate (8),
.BR pvdisplay (8),
.BR pvmove (8),
.BR pvremove (8),
.BR pvresize (8),
.BR pvs (8),
.BR pvscan (8),
.P
.BR vgcfgbackup (8),
.BR vgcfgrestore (8),
.BR vgchange (8),
.BR vgck (8),
.BR vgcreate (8),
.BR vgconvert (8),
.BR vgdisplay (8),
.BR vgexport (8),
.BR vgextend (8),
.BR vgimport (8),
.BR vgimportclone (8),
.BR vgimportdevices (8),
.BR vgmerge (8),
.BR vgmknodes (8),
.BR vgreduce (8),
.BR vgremove (8),
.BR vgrename (8),
.BR vgs (8),
.BR vgscan (8),
.BR vgsplit (8),
.P
.BR lvcreate (8),
.BR lvchange (8),
.BR lvconvert (8),
.BR lvdisplay (8),
.BR lvextend (8),
.BR lvreduce (8),
.BR lvremove (8),
.BR lvrename (8),
.BR lvresize (8),
.BR lvs (8),
.BR lvscan (8),
.P
.BR lvm\-fullreport (8),
.BR lvm\-lvpoll (8),
.BR blkdeactivate (8),
.BR lvmdump (8),
.P
.BR dmeventd (8),
.BR lvmpolld (8),
.BR lvmlockd (8),
.BR lvmlockctl (8),
.BR cmirrord (8),
.BR lvmdbusd (8),
.BR fsadm (8),
.P
.BR lvmsystemid (7),
.BR lvmreport (7),
.BR lvmcache (7),
.BR lvmraid (7),
.BR lvmthin (7),
.BR lvmvdo (7),
.BR lvmautoactivation (7)

