lvm-bin/lvm_2.03.30_build_arm64/share/man/man8/vgchange.8
.TH VGCHANGE 8 "LVM TOOLS 2.03.30(2) (2025-01-14)" "Red Hat, Inc."
.
.SH NAME
.
vgchange \(em Change volume group attributes
.
.SH SYNOPSIS
.
\fBvgchange\fP \fIoption_args\fP \fIposition_args\fP
.br
    [ \fIoption_args\fP ]
.br
    [ \fIposition_args\fP ]
.br
.P
.ad l
 \fB\-a\fP|\fB\-\-activate\fP \fBy\fP|\fBn\fP|\fBay\fP
.br
    \fB\-\-activationmode\fP \fBpartial\fP|\fBdegraded\fP|\fBcomplete\fP
.br
    \fB\-\-addtag\fP \fITag\fP
.br
    \fB\-\-alloc\fP \c
.nh
\%\fBcontiguous\fP|\:\fBcling\fP|\:\fBcling_by_tags\fP|\:\fBnormal\fP|\:\fBanywhere\fP|\:\fBinherit\fP
.hy
.br
    \fB\-\-autoactivation\fP \fIString\fP
.br
 \fB\-A\fP|\fB\-\-autobackup\fP \fBy\fP|\fBn\fP
.br
    \fB\-\-commandprofile\fP \fIString\fP
.br
    \fB\-\-config\fP \fIString\fP
.br
 \fB\-d\fP|\fB\-\-debug\fP
.br
    \fB\-\-deltag\fP \fITag\fP
.br
    \fB\-\-detachprofile\fP
.br
    \fB\-\-devices\fP \fIPV\fP
.br
    \fB\-\-devicesfile\fP \fIString\fP
.br
    \fB\-\-driverloaded\fP \fBy\fP|\fBn\fP
.br
 \fB\-f\fP|\fB\-\-force\fP
.br
 \fB\-h\fP|\fB\-\-help\fP
.br
 \fB\-K\fP|\fB\-\-ignoreactivationskip\fP
.br
    \fB\-\-ignorelockingfailure\fP
.br
    \fB\-\-ignoremonitoring\fP
.br
    \fB\-\-journal\fP \fIString\fP
.br
    \fB\-\-lockopt\fP \fIString\fP
.br
    \fB\-\-lockstart\fP
.br
    \fB\-\-lockstop\fP
.br
    \fB\-\-locktype\fP \fBsanlock\fP|\fBdlm\fP|\fBnone\fP
.br
 \fB\-l\fP|\fB\-\-logicalvolume\fP \fINumber\fP
.br
    \fB\-\-longhelp\fP
.br
    \fB\-\-majoritypvs\fP
.br
 \fB\-p\fP|\fB\-\-maxphysicalvolumes\fP \fINumber\fP
.br
    \fB\-\-metadataprofile\fP \fIString\fP
.br
    \fB\-\-monitor\fP \fBy\fP|\fBn\fP
.br
    \fB\-\-nohints\fP
.br
    \fB\-\-nolocking\fP
.br
    \fB\-\-noudevsync\fP
.br
 \fB\-P\fP|\fB\-\-partial\fP
.br
 \fB\-s\fP|\fB\-\-physicalextentsize\fP \fISize\fP[m|UNIT]
.br
    \fB\-\-poll\fP \fBy\fP|\fBn\fP
.br
    \fB\-\-profile\fP \fIString\fP
.br
    \fB\-\-pvmetadatacopies\fP \fB0\fP|\fB1\fP|\fB2\fP
.br
 \fB\-q\fP|\fB\-\-quiet\fP
.br
    \fB\-\-readonly\fP
.br
    \fB\-\-refresh\fP
.br
    \fB\-\-reportformat\fP \fBbasic\fP|\fBjson\fP|\fBjson_std\fP
.br
 \fB\-x\fP|\fB\-\-resizeable\fP \fBy\fP|\fBn\fP
.br
 \fB\-S\fP|\fB\-\-select\fP \fIString\fP
.br
    \fB\-\-setautoactivation\fP \fBy\fP|\fBn\fP
.br
    \fB\-\-sysinit\fP
.br
    \fB\-\-systemid\fP \fIString\fP
.br
 \fB\-t\fP|\fB\-\-test\fP
.br
 \fB\-u\fP|\fB\-\-uuid\fP
.br
 \fB\-v\fP|\fB\-\-verbose\fP
.br
    \fB\-\-version\fP
.br
    \fB\-\-\fP[\fBvg\fP]\fBmetadatacopies\fP \fBall\fP|\fBunmanaged\fP|\fINumber\fP
.br
 \fB\-y\fP|\fB\-\-yes\fP
.ad b
.
.SH DESCRIPTION
.
vgchange changes VG attributes, changes LV activation in the kernel, and
includes other utilities for VG maintenance.
.
.SH USAGE
.
Change a general VG attribute. 
.br
For options listed in parentheses, any one is 
.br
required, after which the others are optional.
.br
.P
\fBvgchange\fP
.RS 4
( \fB\-l\fP|\fB\-\-logicalvolume\fP \fINumber\fP
.br
  \fB\-p\fP|\fB\-\-maxphysicalvolumes\fP \fINumber\fP
.br
  \fB\-u\fP|\fB\-\-uuid\fP
.br
  \fB\-s\fP|\fB\-\-physicalextentsize\fP \fISize\fP[m|UNIT]
.br
  \fB\-x\fP|\fB\-\-resizeable\fP \fBy\fP|\fBn\fP
.br
     \fB\-\-addtag\fP \fITag\fP
.br
     \fB\-\-deltag\fP \fITag\fP
.br
     \fB\-\-alloc\fP \c
.nh
\%\fBcontiguous\fP|\:\fBcling\fP|\:\fBcling_by_tags\fP|\:\fBnormal\fP|\:\fBanywhere\fP|\:\fBinherit\fP
.hy
.br
     \fB\-\-pvmetadatacopies\fP \fB0\fP|\fB1\fP|\fB2\fP
.br
     \fB\-\-\fP[\fBvg\fP]\fBmetadatacopies\fP \fBall\fP|\fBunmanaged\fP|\fINumber\fP
.br
     \fB\-\-profile\fP \fIString\fP
.br
     \fB\-\-detachprofile\fP
.br
     \fB\-\-metadataprofile\fP \fIString\fP
.br
     \fB\-\-setautoactivation\fP \fBy\fP|\fBn\fP )
.RE
.br
.RS 4
.ad l
[ \fB\-A\fP|\fB\-\-autobackup\fP \fBy\fP|\fBn\fP ]
.br
[ \fB\-S\fP|\fB\-\-select\fP \fIString\fP ]
.br
[ \fB\-f\fP|\fB\-\-force\fP ]
.br
[    \fB\-\-poll\fP \fBy\fP|\fBn\fP ]
.br
[    \fB\-\-ignoremonitoring\fP ]
.br
[    \fB\-\-noudevsync\fP ]
.br
[    \fB\-\-reportformat\fP \fBbasic\fP|\fBjson\fP|\fBjson_std\fP ]
.br
[ COMMON_OPTIONS ]
.ad b
.RE
.RS 4
[ \fIVG\fP|\fITag\fP|\fISelect\fP ... ]
.RE
.P
\(em
.P
Start or stop monitoring LVs from dmeventd.
.br
.P
\fBvgchange\fP \fB\-\-monitor\fP \fBy\fP|\fBn\fP
.br
.RS 4
.ad l
[ \fB\-A\fP|\fB\-\-autobackup\fP \fBy\fP|\fBn\fP ]
.br
[ \fB\-S\fP|\fB\-\-select\fP \fIString\fP ]
.br
[ \fB\-f\fP|\fB\-\-force\fP ]
.br
[    \fB\-\-sysinit\fP ]
.br
[    \fB\-\-ignorelockingfailure\fP ]
.br
[    \fB\-\-poll\fP \fBy\fP|\fBn\fP ]
.br
[    \fB\-\-ignoremonitoring\fP ]
.br
[    \fB\-\-noudevsync\fP ]
.br
[    \fB\-\-reportformat\fP \fBbasic\fP|\fBjson\fP|\fBjson_std\fP ]
.br
[ COMMON_OPTIONS ]
.ad b
.RE
.RS 4
[ \fIVG\fP|\fITag\fP|\fISelect\fP ... ]
.RE
.P
\(em
.P
Start or stop processing LV conversions.
.br
.P
\fBvgchange\fP \fB\-\-poll\fP \fBy\fP|\fBn\fP
.br
.RS 4
.ad l
[ \fB\-A\fP|\fB\-\-autobackup\fP \fBy\fP|\fBn\fP ]
.br
[ \fB\-S\fP|\fB\-\-select\fP \fIString\fP ]
.br
[ \fB\-f\fP|\fB\-\-force\fP ]
.br
[    \fB\-\-ignorelockingfailure\fP ]
.br
[    \fB\-\-ignoremonitoring\fP ]
.br
[    \fB\-\-noudevsync\fP ]
.br
[    \fB\-\-reportformat\fP \fBbasic\fP|\fBjson\fP|\fBjson_std\fP ]
.br
[ COMMON_OPTIONS ]
.ad b
.RE
.RS 4
[ \fIVG\fP|\fITag\fP|\fISelect\fP ... ]
.RE
.P
\(em
.P
Activate or deactivate LVs.
.br
.P
\fBvgchange\fP \fB\-a\fP|\fB\-\-activate\fP \fBy\fP|\fBn\fP|\fBay\fP
.br
.RS 4
.ad l
[ \fB\-K\fP|\fB\-\-ignoreactivationskip\fP ]
.br
[ \fB\-P\fP|\fB\-\-partial\fP ]
.br
[ \fB\-A\fP|\fB\-\-autobackup\fP \fBy\fP|\fBn\fP ]
.br
[ \fB\-S\fP|\fB\-\-select\fP \fIString\fP ]
.br
[ \fB\-f\fP|\fB\-\-force\fP ]
.br
[    \fB\-\-activationmode\fP \fBpartial\fP|\fBdegraded\fP|\fBcomplete\fP ]
.br
[    \fB\-\-sysinit\fP ]
.br
[    \fB\-\-readonly\fP ]
.br
[    \fB\-\-ignorelockingfailure\fP ]
.br
[    \fB\-\-monitor\fP \fBy\fP|\fBn\fP ]
.br
[    \fB\-\-poll\fP \fBy\fP|\fBn\fP ]
.br
[    \fB\-\-autoactivation\fP \fIString\fP ]
.br
[    \fB\-\-ignoremonitoring\fP ]
.br
[    \fB\-\-noudevsync\fP ]
.br
[    \fB\-\-reportformat\fP \fBbasic\fP|\fBjson\fP|\fBjson_std\fP ]
.br
[ COMMON_OPTIONS ]
.ad b
.RE
.RS 4
[ \fIVG\fP|\fITag\fP|\fISelect\fP ... ]
.RE
.P
\(em
.P
Reactivate LVs using the latest metadata.
.br
.P
\fBvgchange\fP \fB\-\-refresh\fP
.br
.RS 4
.ad l
[ \fB\-A\fP|\fB\-\-autobackup\fP \fBy\fP|\fBn\fP ]
.br
[ \fB\-S\fP|\fB\-\-select\fP \fIString\fP ]
.br
[ \fB\-f\fP|\fB\-\-force\fP ]
.br
[    \fB\-\-sysinit\fP ]
.br
[    \fB\-\-ignorelockingfailure\fP ]
.br
[    \fB\-\-poll\fP \fBy\fP|\fBn\fP ]
.br
[    \fB\-\-ignoremonitoring\fP ]
.br
[    \fB\-\-noudevsync\fP ]
.br
[    \fB\-\-reportformat\fP \fBbasic\fP|\fBjson\fP|\fBjson_std\fP ]
.br
[ COMMON_OPTIONS ]
.ad b
.RE
.RS 4
[ \fIVG\fP|\fITag\fP|\fISelect\fP ... ]
.RE
.P
\(em
.P
Change the system ID of a VG.
.br
.P
\fBvgchange\fP \fB\-\-systemid\fP \fIString\fP \fIVG\fP|\fITag\fP|\fISelect\fP
.br
.RS 4
.ad l
[ \fB\-S\fP|\fB\-\-select\fP \fIString\fP ]
.br
[    \fB\-\-majoritypvs\fP ]
.br
[ COMMON_OPTIONS ]
.ad b
.RE
.P
\(em
.P
Start the lockspace of a shared VG in lvmlockd.
.br
.P
\fBvgchange\fP \fB\-\-lockstart\fP
.br
.RS 4
.ad l
[ \fB\-S\fP|\fB\-\-select\fP \fIString\fP ]
.br
[ COMMON_OPTIONS ]
.ad b
.RE
.RS 4
[ \fIVG\fP|\fITag\fP|\fISelect\fP ... ]
.RE
.P
\(em
.P
Stop the lockspace of a shared VG in lvmlockd.
.br
.P
\fBvgchange\fP \fB\-\-lockstop\fP
.br
.RS 4
.ad l
[ \fB\-S\fP|\fB\-\-select\fP \fIString\fP ]
.br
[ COMMON_OPTIONS ]
.ad b
.RE
.RS 4
[ \fIVG\fP|\fITag\fP|\fISelect\fP ... ]
.RE
.P
\(em
.P
Change the lock type for a shared VG.
.br
.P
\fBvgchange\fP \fB\-\-locktype\fP \fBsanlock\fP|\fBdlm\fP|\fBnone\fP \fIVG\fP
.br
.RS 4
.ad l
[ COMMON_OPTIONS ]
.ad b
.RE
.P
\(em
.P
Common options for lvm:
.
.RS 4
.ad l
[ \fB\-d\fP|\fB\-\-debug\fP ]
.br
[ \fB\-h\fP|\fB\-\-help\fP ]
.br
[ \fB\-q\fP|\fB\-\-quiet\fP ]
.br
[ \fB\-t\fP|\fB\-\-test\fP ]
.br
[ \fB\-v\fP|\fB\-\-verbose\fP ]
.br
[ \fB\-y\fP|\fB\-\-yes\fP ]
.br
[    \fB\-\-commandprofile\fP \fIString\fP ]
.br
[    \fB\-\-config\fP \fIString\fP ]
.br
[    \fB\-\-devices\fP \fIPV\fP ]
.br
[    \fB\-\-devicesfile\fP \fIString\fP ]
.br
[    \fB\-\-driverloaded\fP \fBy\fP|\fBn\fP ]
.br
[    \fB\-\-journal\fP \fIString\fP ]
.br
[    \fB\-\-lockopt\fP \fIString\fP ]
.br
[    \fB\-\-longhelp\fP ]
.br
[    \fB\-\-nohints\fP ]
.br
[    \fB\-\-nolocking\fP ]
.br
[    \fB\-\-profile\fP \fIString\fP ]
.br
[    \fB\-\-version\fP ]
.ad b
.RE
.
.SH OPTIONS
.
.
.HP
\fB\-a\fP|\fB\-\-activate\fP \fBy\fP|\fBn\fP|\fBay\fP
.br
Change the active state of LVs.
An active LV can be used through a block device,
allowing data on the LV to be accessed.
\fBy\fP makes LVs active, or available.
\fBn\fP makes LVs inactive, or unavailable.
The block device for the LV is added or removed from the system
using device-mapper in the kernel.
A symbolic link /dev/VGName/LVName pointing to the device node is also added/removed.
All software and scripts should access the device through the symbolic
link and present this as the name of the device.
The location and name of the underlying device node may depend on
the distribution, configuration (e.g. udev), or release version.
\fBay\fP specifies autoactivation, which is used by system-generated
activation commands. By default, LVs are autoactivated.
An autoactivation property can be set on a VG or LV to disable autoactivation,
see \-\-setautoactivation y|n in vgchange, lvchange, vgcreate, and lvcreate.
Display the property with vgs or lvs "\-o autoactivation".
The \fBlvm.conf\fP(5) auto_activation_volume_list includes names of VGs or LVs
that should be autoactivated, and anything not listed is not autoactivated.
When auto_activation_volume_list is undefined (the default), it has no effect.
If auto_activation_volume_list is defined and empty, no LVs are autoactivated.
Items included by auto_activation_volume_list will not be autoactivated if
the autoactivation property has been disabled.
See \fBlvmlockd\fP(8) for more information about activation options \fBey\fP and \fBsy\fP for shared VGs.
.
.HP
\fB\-\-activationmode\fP \fBpartial\fP|\fBdegraded\fP|\fBcomplete\fP
.br
Determines if LV activation is allowed when PVs are missing,
e.g. because of a device failure.
\fBcomplete\fP only allows LVs with no missing PVs to be activated,
and is the most restrictive mode.
\fBdegraded\fP allows RAID LVs with missing PVs to be activated.
(This does not include the "mirror" type, see "raid1" instead.)
\fBpartial\fP allows any LV with missing PVs to be activated, and
should only be used for recovery or repair.
For default, see \fBlvm.conf\fP(5) activation_mode.
See \fBlvmraid\fP(7) for more information.
.
.HP
\fB\-\-addtag\fP \fITag\fP
.br
Adds a tag to a PV, VG or LV. This option can be repeated to add
multiple tags at once. See \fBlvm\fP(8) for information about tags.
.
.HP
.ad l
\fB\-\-alloc\fP \c
.nh
\%\fBcontiguous\fP|\:\fBcling\fP|\:\fBcling_by_tags\fP|\:\fBnormal\fP|\:\fBanywhere\fP|\:\fBinherit\fP
.hy
.ad b
.br
Determines the allocation policy when a command needs to allocate
Physical Extents (PEs) from the VG. Each VG and LV has an allocation policy
which can be changed with vgchange/lvchange, or overridden on the
command line.
\fBnormal\fP applies common sense rules such as not placing parallel stripes
on the same PV.
\fBinherit\fP applies the VG policy to an LV.
\fBcontiguous\fP requires new PEs be placed adjacent to existing PEs.
\fBcling\fP places new PEs on the same PV as existing PEs in the same
stripe of the LV.
If there are sufficient PEs for an allocation, but normal does not
use them, \fBanywhere\fP will use them even if it reduces performance,
e.g. by placing two stripes on the same PV.
Optional positional PV args on the command line can also be used to limit
which PVs the command will use for allocation.
See \fBlvm\fP(8) for more information about allocation.
.
.HP
\fB\-\-autoactivation\fP \fIString\fP
.br
Specify if autoactivation is being used from an event.
This allows the command to apply settings that are specific
to event activation, such as device scanning optimizations
using pvs_online files created by event-based pvscans.
.
.HP
\fB\-A\fP|\fB\-\-autobackup\fP \fBy\fP|\fBn\fP
.br
Specifies if metadata should be backed up automatically after a change.
Enabling this is strongly advised! See \fBvgcfgbackup\fP(8) for more information.
.
.HP
\fB\-\-commandprofile\fP \fIString\fP
.br
The command profile to use for command configuration.
See \fBlvm.conf\fP(5) for more information about profiles.
.
.HP
\fB\-\-config\fP \fIString\fP
.br
Config settings for the command. These override \fBlvm.conf\fP(5) settings.
The String arg uses the same format as \fBlvm.conf\fP(5),
or may use section/field syntax.
See \fBlvm.conf\fP(5) for more information about config.
.
.HP
\fB\-d\fP|\fB\-\-debug\fP ...
.br
Set debug level. Repeat from 1 to 6 times to increase the detail of
messages sent to the log file and/or syslog (if configured).
.
.HP
\fB\-\-deltag\fP \fITag\fP
.br
Deletes a tag from a PV, VG or LV. This option can be repeated to delete
multiple tags at once. See \fBlvm\fP(8) for information about tags.
.
.HP
\fB\-\-detachprofile\fP
.br
Detaches a metadata profile from a VG or LV.
See \fBlvm.conf\fP(5) for more information about profiles.
.
.HP
\fB\-\-devices\fP \fIPV\fP
.br
Restricts the devices that are visible and accessible to the command.
Devices not listed will appear to be missing. This option can be
repeated, or accepts a comma separated list of devices. This overrides
the devices file.
.
.HP
\fB\-\-devicesfile\fP \fIString\fP
.br
A file listing devices that LVM should use.
The file must exist in \fI/lvm/etc/devices/\fP and is managed
with the \fBlvmdevices\fP(8) command.
This overrides the \fBlvm.conf\fP(5) \fBdevices/devicesfile\fP and
\fBdevices/use_devicesfile\fP settings.
.
.HP
\fB\-\-driverloaded\fP \fBy\fP|\fBn\fP
.br
If set to no, the command will not attempt to use device-mapper.
For testing and debugging.
.
.HP
\fB\-f\fP|\fB\-\-force\fP ...
.br
Override various checks, confirmations and protections.
Use with extreme caution.
.
.HP
\fB\-h\fP|\fB\-\-help\fP
.br
Display help text.
.
.HP
\fB\-K\fP|\fB\-\-ignoreactivationskip\fP
.br
Ignore the "activation skip" LV flag during activation
to allow LVs with the flag set to be activated.
.
.HP
\fB\-\-ignorelockingfailure\fP
.br
Allows a command to continue with read-only metadata
operations after locking failures.
.
.HP
\fB\-\-ignoremonitoring\fP
.br
Do not interact with dmeventd unless \-\-monitor is specified.
Do not use this if dmeventd is already monitoring a device.
.
.HP
\fB\-\-journal\fP \fIString\fP
.br
Record information in the systemd journal.
This information is in addition to information
enabled by the lvm.conf log/journal setting.
command: record information about the command.
output: record the default command output.
debug: record full command debugging.
.
.HP
\fB\-\-lockopt\fP \fIString\fP
.br
Used to pass options for special cases to lvmlockd.
See \fBlvmlockd\fP(8) for more information.
.
.HP
\fB\-\-lockstart\fP
.br
Start the lockspace of a shared VG in lvmlockd.
lvmlockd locks becomes available for the VG, allowing LVM to use the VG.
See \fBlvmlockd\fP(8) for more information.
.
.HP
\fB\-\-lockstop\fP
.br
Stop the lockspace of a shared VG in lvmlockd.
lvmlockd locks become unavailable for the VG, preventing LVM from using the VG.
See \fBlvmlockd\fP(8) for more information.
.
.HP
\fB\-\-locktype\fP \fBsanlock\fP|\fBdlm\fP|\fBnone\fP
.br
Change the VG lock type to or from a shared lock type used with lvmlockd.
See \fBlvmlockd\fP(8) for more information.
.
.HP
\fB\-l\fP|\fB\-\-logicalvolume\fP \fINumber\fP
.br
Sets the maximum number of LVs allowed in a VG.
.
.HP
\fB\-\-longhelp\fP
.br
Display long help text.
.
.HP
\fB\-\-majoritypvs\fP
.br
Change the VG system ID if the majority of PVs in the VG
are present (one more than half).
.
.HP
\fB\-p\fP|\fB\-\-maxphysicalvolumes\fP \fINumber\fP
.br
Sets the maximum number of PVs that can belong to the VG.
The value 0 removes any limitation.
For large numbers of PVs, also see options \-\-pvmetadatacopies,
and \-\-vgmetadatacopies for improving performance.
.
.HP
\fB\-\-metadataprofile\fP \fIString\fP
.br
The metadata profile to use for command configuration.
See \fBlvm.conf\fP(5) for more information about profiles.
.
.HP
\fB\-\-monitor\fP \fBy\fP|\fBn\fP
.br
Start (yes) or stop (no) monitoring an LV with dmeventd.
dmeventd monitors kernel events for an LV, and performs
automated maintenance for the LV in response to specific events.
See \fBdmeventd\fP(8) for more information.
.
.HP
\fB\-\-nohints\fP
.br
Do not use the hints file to locate devices for PVs. A command may read
more devices to find PVs when hints are not used. The command will still
perform standard hint file invalidation where appropriate.
.
.HP
\fB\-\-nolocking\fP
.br
Disable locking. Use with caution, concurrent commands may produce
incorrect results.
.
.HP
\fB\-\-noudevsync\fP
.br
Disables udev synchronization. The process will not wait for notification
from udev. It will continue irrespective of any possible udev processing
in the background. Only use this if udev is not running or has rules that
ignore the devices LVM creates.
.
.HP
\fB\-P\fP|\fB\-\-partial\fP
.br
Commands will do their best to activate LVs with missing PV extents.
Missing extents may be replaced with error or zero segments
according to the  missing_stripe_filler setting.
Metadata may not be changed with this option.
.
.HP
\fB\-s\fP|\fB\-\-physicalextentsize\fP \fISize\fP[m|UNIT]
.br
Sets the physical extent size of PVs in the VG.
The value must be either a power of 2 of at least 1 sector
(where the sector size is the largest sector size of the PVs
currently used in the VG), or at least 128\ KiB.
Once this value has been set, it is difficult to change
without recreating the VG, unless no extents need moving.
Before increasing the physical extent size, you might need to use lvresize,
pvresize and/or pvmove so that everything fits. For example, every
contiguous range of extents used in a LV must start and end on an extent boundary.
.
.HP
\fB\-\-poll\fP \fBy\fP|\fBn\fP
.br
When yes, start the background transformation of an LV.
An incomplete transformation, e.g. pvmove or lvconvert interrupted
by reboot or crash, can be restarted from the last checkpoint with \-\-poll y.
When no, background transformation of an LV will not occur, and the
transformation will not complete. It may not be appropriate to immediately
poll an LV after activation, in which case \-\-poll n can be used to defer
polling until a later \-\-poll y command.
.
.HP
\fB\-\-profile\fP \fIString\fP
.br
An alias for \-\-commandprofile or \-\-metadataprofile, depending
on the command.
.
.HP
\fB\-\-pvmetadatacopies\fP \fB0\fP|\fB1\fP|\fB2\fP
.br
The number of metadata areas to set aside on a PV for storing VG metadata.
When 2, one copy of the VG metadata is stored at the front of the PV
and a second copy is stored at the end.
When 1, one copy of the VG metadata is stored at the front of the PV.
When 0, no copies of the VG metadata are stored on the given PV.
This may be useful in VGs containing many PVs (this places limitations
on the ability to use vgsplit later.)
.
.HP
\fB\-q\fP|\fB\-\-quiet\fP ...
.br
Suppress output and log messages. Overrides \-\-debug and \-\-verbose.
Repeat once to also suppress any prompts with answer 'no'.
.
.HP
\fB\-\-readonly\fP
.br
Prevent the command from making changes, including activation and
metadata updates.  (See \-\-permission r for read only LVs.)
.
.HP
\fB\-\-refresh\fP
.br
If the LV is active, reload its metadata.
In an environment where udev is used to manage the /dev content,
usage of this option is highly recommended. This is because refresh
also regenerates udev events for an LV based on which existing udev
rules are applied to set the /dev content and permissions.
Also, this operation may be useful if something has gone wrong,
or if some form of manual LV sharing is being used.
.
.HP
\fB\-\-reportformat\fP \fBbasic\fP|\fBjson\fP|\fBjson_std\fP
.br
Overrides current output format for reports which is defined globally by
the report/output_format setting in \fBlvm.conf\fP(5).
\fBbasic\fP is the original format with columns and rows.
If there is more than one report per command, each report is prefixed
with the report name for identification. \fBjson\fP produces report
output in JSON format. \fBjson_std\fP produces report output in
JSON format which is more compliant with JSON standard.
See \fBlvmreport\fP(7) for more information.
.
.HP
\fB\-x\fP|\fB\-\-resizeable\fP \fBy\fP|\fBn\fP
.br
Enables or disables the addition or removal of PVs to/from a VG
(by vgextend/vgreduce).
.
.HP
\fB\-S\fP|\fB\-\-select\fP \fIString\fP
.br
Select objects for processing and reporting based on specified criteria.
The criteria syntax is described by \fB\-\-select help\fP and \fBlvmreport\fP(7).
For reporting commands, one row is displayed for each object matching the criteria.
See \fB\-\-options help\fP for selectable object fields.
Rows can be displayed with an additional "selected" field (\-o selected)
showing 1 if the row matches the selection and 0 otherwise.
For non-reporting commands which process LVM entities, the selection is
used to choose items to process.
.
.HP
\fB\-\-setautoactivation\fP \fBy\fP|\fBn\fP
.br
Set the autoactivation property on a VG or LV.
Display the property with vgs or lvs "\-o autoactivation".
When the autoactivation property is disabled, the VG or LV
will not be activated by a command doing autoactivation
(vgchange, lvchange, or pvscan using \-aay.)
If autoactivation is disabled on a VG, no LVs will be autoactivated
in that VG, and the LV autoactivation property has no effect.
If autoactivation is enabled on a VG, autoactivation can be disabled
for individual LVs.
.
.HP
\fB\-\-sysinit\fP
.br
Indicates that vgchange/lvchange is being invoked from early system initialisation
scripts (e.g. rc.sysinit or an initrd), before writable filesystems are
available. As such, some functionality needs to be disabled and this option
acts as a shortcut which selects an appropriate set of options. Currently,
this is equivalent to using \-\-ignorelockingfailure, \-\-ignoremonitoring,
\-\-poll n, and setting env var LVM_SUPPRESS_LOCKING_FAILURE_MESSAGES.
vgchange/lvchange skip autoactivation, and defer to pvscan autoactivation.
.
.HP
\fB\-\-systemid\fP \fIString\fP
.br
Changes the system ID of the VG. Using this option requires caution
because the VG may become foreign to the host running the command,
leaving the host unable to access it.
See \fBlvmsystemid\fP(7) for more information.
.
.HP
\fB\-t\fP|\fB\-\-test\fP
.br
Run in test mode. Commands will not update metadata.
This is implemented by disabling all metadata writing but nevertheless
returning success to the calling function. This may lead to unusual
error messages in multi-stage operations if a tool relies on reading
back metadata it believes has changed but hasn't.
.
.HP
\fB\-u\fP|\fB\-\-uuid\fP
.br
Generate new random UUID for specified VGs.
.
.HP
\fB\-v\fP|\fB\-\-verbose\fP ...
.br
Set verbose level. Repeat from 1 to 4 times to increase the detail
of messages sent to stdout and stderr.
.
.HP
\fB\-\-version\fP
.br
Display version information.
.
.HP
\fB\-\-\fP[\fBvg\fP]\fBmetadatacopies\fP \fBall\fP|\fBunmanaged\fP|\fINumber\fP
.br
Number of copies of the VG metadata that are kept.
VG metadata is kept in VG metadata areas on PVs in the VG,
i.e. reserved space at the start and/or end of the PVs.
Keeping a copy of the VG metadata on every PV can reduce performance
in VGs containing a large number of PVs.
When this number is set to a non-zero value, LVM will automatically
choose PVs on which to store metadata, using the metadataignore flags
on PVs to achieve the specified number.
The number can also be replaced with special string values:
\fBunmanaged\fP causes LVM to not automatically manage the PV
metadataignore flags.
\fBall\fP causes LVM to first clear the metadataignore flags on
all PVs, and then to become unmanaged.
.
.HP
\fB\-y\fP|\fB\-\-yes\fP
.br
Do not prompt for confirmation interactively but always assume the
answer yes. Use with extreme caution.
(For automatic no, see \-qq.)
.
.SH VARIABLES
.
.TP
.I VG
Volume Group name.  See \fBlvm\fP(8) for valid names.
.TP
.I Tag
Tag name.  See \fBlvm\fP(8) for information about tag names and using tags
in place of a VG, LV or PV.
.TP
.I Select
Select indicates that a required positional parameter can
be omitted if the \fB\-\-select\fP option is used.
No arg appears in this position.
.TP
.I String
See the option description for information about the string content.
.TP
.IR Size [UNIT]
Size is an input number that accepts an optional unit.
Input units are always treated as base two values, regardless of
capitalization, e.g. 'k' and 'K' both refer to 1024.
The default input unit is specified by letter, followed by |UNIT.
UNIT represents other possible input units:
.BR b | B
is bytes,
.BR s | S
is sectors of 512 bytes,
.BR k | K
is KiB,
.BR m | M
is MiB,
.BR g | G
is GiB,
.BR t | T
is TiB,
.BR p | P
is PiB,
.BR e | E
is EiB.
(This should not be confused with the output control \-\-units, where
capital letters mean multiple of 1000.)
.
.SH ENVIRONMENT VARIABLES
.
See \fBlvm\fP(8) for information about environment variables used by lvm.
For example, LVM_VG_NAME can generally be substituted for a required VG parameter.
.
.SH NOTES
.
If vgchange recognizes COW snapshot LVs that were dropped because they ran
out of space, it displays a message informing the administrator that the
snapshots should be removed.
.
.SH EXAMPLES
.
Activate all LVs in all VGs on all existing devices.
.br
.B vgchange \-a y
.P
Change the maximum number of LVs for an inactive VG.
.br
.B vgchange \-l 128 vg00
.
.SH SEE ALSO
.
.nh
.ad l
.BR lvm (8),
.BR lvm.conf (5),
.BR lvmconfig (8),
.BR lvmdevices (8),
.P
.BR pvchange (8),
.BR pvck (8),
.BR pvcreate (8),
.BR pvdisplay (8),
.BR pvmove (8),
.BR pvremove (8),
.BR pvresize (8),
.BR pvs (8),
.BR pvscan (8),
.P
.BR vgcfgbackup (8),
.BR vgcfgrestore (8),
.BR vgchange (8),
.BR vgck (8),
.BR vgcreate (8),
.BR vgconvert (8),
.BR vgdisplay (8),
.BR vgexport (8),
.BR vgextend (8),
.BR vgimport (8),
.BR vgimportclone (8),
.BR vgimportdevices (8),
.BR vgmerge (8),
.BR vgmknodes (8),
.BR vgreduce (8),
.BR vgremove (8),
.BR vgrename (8),
.BR vgs (8),
.BR vgscan (8),
.BR vgsplit (8),
.P
.BR lvcreate (8),
.BR lvchange (8),
.BR lvconvert (8),
.BR lvdisplay (8),
.BR lvextend (8),
.BR lvreduce (8),
.BR lvremove (8),
.BR lvrename (8),
.BR lvresize (8),
.BR lvs (8),
.BR lvscan (8),
.P
.BR lvm\-fullreport (8),
.BR lvm\-lvpoll (8),
.BR blkdeactivate (8),
.BR lvmdump (8),
.P
.BR dmeventd (8),
.BR lvmpolld (8),
.BR lvmlockd (8),
.BR lvmlockctl (8),
.BR cmirrord (8),
.BR lvmdbusd (8),
.BR fsadm (8),
.P
.BR lvmsystemid (7),
.BR lvmreport (7),
.BR lvmcache (7),
.BR lvmraid (7),
.BR lvmthin (7),
.BR lvmvdo (7),
.BR lvmautoactivation (7)

