lvm-bin/lvm_2.03.30_build_arm64/share/man/man8/vgrename.8
.TH VGRENAME 8 "LVM TOOLS 2.03.30(2) (2025-01-14)" "Red Hat, Inc."
.
.SH NAME
.
vgrename \(em Rename a volume group
.
.SH SYNOPSIS
.
\fBvgrename\fP \fIposition_args\fP
.br
    [ \fIoption_args\fP ]
.br
.
.SH DESCRIPTION
.
vgrename renames a VG.
.P
All VGs visible to a system need to have different names, otherwise many
LVM commands will refuse to run or give warning messages. VGs with the
same name can occur when disks are moved between machines, or filters are
changed. If a newly connected disk has a VG with the same name as the VG
containing the root filesystem, the machine may not boot correctly. When
two VGs have the same name, the VG UUID can be used in place of the source
VG name.
.
.SH USAGE
.
Rename a VG.
.br
.P
\fBvgrename\fP \fIVG\fP \fIVG\fP\fI_new\fP
.br
.RS 4
.ad l
[ COMMON_OPTIONS ]
.ad b
.RE
.P
Rename a VG by specifying the VG UUID.
.br
.P
\fBvgrename\fP \fIString\fP \fIVG\fP\fI_new\fP
.br
.RS 4
.ad l
[ COMMON_OPTIONS ]
.ad b
.RE
.P
Common options for command:
.
.RS 4
.ad l
[ \fB\-A\fP|\fB\-\-autobackup\fP \fBy\fP|\fBn\fP ]
.br
[ \fB\-f\fP|\fB\-\-force\fP ]
.br
[    \fB\-\-reportformat\fP \fBbasic\fP|\fBjson\fP|\fBjson_std\fP ]
.ad b
.RE
.P
Common options for lvm:
.
.RS 4
.ad l
[ \fB\-d\fP|\fB\-\-debug\fP ]
.br
[ \fB\-h\fP|\fB\-\-help\fP ]
.br
[ \fB\-q\fP|\fB\-\-quiet\fP ]
.br
[ \fB\-t\fP|\fB\-\-test\fP ]
.br
[ \fB\-v\fP|\fB\-\-verbose\fP ]
.br
[ \fB\-y\fP|\fB\-\-yes\fP ]
.br
[    \fB\-\-commandprofile\fP \fIString\fP ]
.br
[    \fB\-\-config\fP \fIString\fP ]
.br
[    \fB\-\-devices\fP \fIPV\fP ]
.br
[    \fB\-\-devicesfile\fP \fIString\fP ]
.br
[    \fB\-\-driverloaded\fP \fBy\fP|\fBn\fP ]
.br
[    \fB\-\-journal\fP \fIString\fP ]
.br
[    \fB\-\-lockopt\fP \fIString\fP ]
.br
[    \fB\-\-longhelp\fP ]
.br
[    \fB\-\-nohints\fP ]
.br
[    \fB\-\-nolocking\fP ]
.br
[    \fB\-\-profile\fP \fIString\fP ]
.br
[    \fB\-\-version\fP ]
.ad b
.RE
.
.SH OPTIONS
.
.
.HP
\fB\-A\fP|\fB\-\-autobackup\fP \fBy\fP|\fBn\fP
.br
Specifies if metadata should be backed up automatically after a change.
Enabling this is strongly advised! See \fBvgcfgbackup\fP(8) for more information.
.
.HP
\fB\-\-commandprofile\fP \fIString\fP
.br
The command profile to use for command configuration.
See \fBlvm.conf\fP(5) for more information about profiles.
.
.HP
\fB\-\-config\fP \fIString\fP
.br
Config settings for the command. These override \fBlvm.conf\fP(5) settings.
The String arg uses the same format as \fBlvm.conf\fP(5),
or may use section/field syntax.
See \fBlvm.conf\fP(5) for more information about config.
.
.HP
\fB\-d\fP|\fB\-\-debug\fP ...
.br
Set debug level. Repeat from 1 to 6 times to increase the detail of
messages sent to the log file and/or syslog (if configured).
.
.HP
\fB\-\-devices\fP \fIPV\fP
.br
Restricts the devices that are visible and accessible to the command.
Devices not listed will appear to be missing. This option can be
repeated, or accepts a comma separated list of devices. This overrides
the devices file.
.
.HP
\fB\-\-devicesfile\fP \fIString\fP
.br
A file listing devices that LVM should use.
The file must exist in \fI/lvm/etc/devices/\fP and is managed
with the \fBlvmdevices\fP(8) command.
This overrides the \fBlvm.conf\fP(5) \fBdevices/devicesfile\fP and
\fBdevices/use_devicesfile\fP settings.
.
.HP
\fB\-\-driverloaded\fP \fBy\fP|\fBn\fP
.br
If set to no, the command will not attempt to use device-mapper.
For testing and debugging.
.
.HP
\fB\-f\fP|\fB\-\-force\fP ...
.br
Override various checks, confirmations and protections.
Use with extreme caution.
.
.HP
\fB\-h\fP|\fB\-\-help\fP
.br
Display help text.
.
.HP
\fB\-\-journal\fP \fIString\fP
.br
Record information in the systemd journal.
This information is in addition to information
enabled by the lvm.conf log/journal setting.
command: record information about the command.
output: record the default command output.
debug: record full command debugging.
.
.HP
\fB\-\-lockopt\fP \fIString\fP
.br
Used to pass options for special cases to lvmlockd.
See \fBlvmlockd\fP(8) for more information.
.
.HP
\fB\-\-longhelp\fP
.br
Display long help text.
.
.HP
\fB\-\-nohints\fP
.br
Do not use the hints file to locate devices for PVs. A command may read
more devices to find PVs when hints are not used. The command will still
perform standard hint file invalidation where appropriate.
.
.HP
\fB\-\-nolocking\fP
.br
Disable locking. Use with caution, concurrent commands may produce
incorrect results.
.
.HP
\fB\-\-profile\fP \fIString\fP
.br
An alias for \-\-commandprofile or \-\-metadataprofile, depending
on the command.
.
.HP
\fB\-q\fP|\fB\-\-quiet\fP ...
.br
Suppress output and log messages. Overrides \-\-debug and \-\-verbose.
Repeat once to also suppress any prompts with answer 'no'.
.
.HP
\fB\-\-reportformat\fP \fBbasic\fP|\fBjson\fP|\fBjson_std\fP
.br
Overrides current output format for reports which is defined globally by
the report/output_format setting in \fBlvm.conf\fP(5).
\fBbasic\fP is the original format with columns and rows.
If there is more than one report per command, each report is prefixed
with the report name for identification. \fBjson\fP produces report
output in JSON format. \fBjson_std\fP produces report output in
JSON format which is more compliant with JSON standard.
See \fBlvmreport\fP(7) for more information.
.
.HP
\fB\-t\fP|\fB\-\-test\fP
.br
Run in test mode. Commands will not update metadata.
This is implemented by disabling all metadata writing but nevertheless
returning success to the calling function. This may lead to unusual
error messages in multi-stage operations if a tool relies on reading
back metadata it believes has changed but hasn't.
.
.HP
\fB\-v\fP|\fB\-\-verbose\fP ...
.br
Set verbose level. Repeat from 1 to 4 times to increase the detail
of messages sent to stdout and stderr.
.
.HP
\fB\-\-version\fP
.br
Display version information.
.
.HP
\fB\-y\fP|\fB\-\-yes\fP
.br
Do not prompt for confirmation interactively but always assume the
answer yes. Use with extreme caution.
(For automatic no, see \-qq.)
.
.SH VARIABLES
.
.TP
.I VG
Volume Group name.  See \fBlvm\fP(8) for valid names.
.TP
.I String
See the option description for information about the string content.
.TP
.IR Size [UNIT]
Size is an input number that accepts an optional unit.
Input units are always treated as base two values, regardless of
capitalization, e.g. 'k' and 'K' both refer to 1024.
The default input unit is specified by letter, followed by |UNIT.
UNIT represents other possible input units:
.BR b | B
is bytes,
.BR s | S
is sectors of 512 bytes,
.BR k | K
is KiB,
.BR m | M
is MiB,
.BR g | G
is GiB,
.BR t | T
is TiB,
.BR p | P
is PiB,
.BR e | E
is EiB.
(This should not be confused with the output control \-\-units, where
capital letters mean multiple of 1000.)
.
.SH ENVIRONMENT VARIABLES
.
See \fBlvm\fP(8) for information about environment variables used by lvm.
For example, LVM_VG_NAME can generally be substituted for a required VG parameter.
.
.SH EXAMPLES
.
Rename VG "vg02" to "myvg":
.br
.B vgrename "vg02" "myvg"
.P
Rename the VG with the specified UUID to "myvg".
.br
.B vgrename Zvlifi-Ep3t\-e0Ng\-U42h\-o0ye\-KHu1\-nl7Ns4 myvg
.
.SH SEE ALSO
.
.nh
.ad l
.BR lvm (8),
.BR lvm.conf (5),
.BR lvmconfig (8),
.BR lvmdevices (8),
.P
.BR pvchange (8),
.BR pvck (8),
.BR pvcreate (8),
.BR pvdisplay (8),
.BR pvmove (8),
.BR pvremove (8),
.BR pvresize (8),
.BR pvs (8),
.BR pvscan (8),
.P
.BR vgcfgbackup (8),
.BR vgcfgrestore (8),
.BR vgchange (8),
.BR vgck (8),
.BR vgcreate (8),
.BR vgconvert (8),
.BR vgdisplay (8),
.BR vgexport (8),
.BR vgextend (8),
.BR vgimport (8),
.BR vgimportclone (8),
.BR vgimportdevices (8),
.BR vgmerge (8),
.BR vgmknodes (8),
.BR vgreduce (8),
.BR vgremove (8),
.BR vgrename (8),
.BR vgs (8),
.BR vgscan (8),
.BR vgsplit (8),
.P
.BR lvcreate (8),
.BR lvchange (8),
.BR lvconvert (8),
.BR lvdisplay (8),
.BR lvextend (8),
.BR lvreduce (8),
.BR lvremove (8),
.BR lvrename (8),
.BR lvresize (8),
.BR lvs (8),
.BR lvscan (8),
.P
.BR lvm\-fullreport (8),
.BR lvm\-lvpoll (8),
.BR blkdeactivate (8),
.BR lvmdump (8),
.P
.BR dmeventd (8),
.BR lvmpolld (8),
.BR lvmlockd (8),
.BR lvmlockctl (8),
.BR cmirrord (8),
.BR lvmdbusd (8),
.BR fsadm (8),
.P
.BR lvmsystemid (7),
.BR lvmreport (7),
.BR lvmcache (7),
.BR lvmraid (7),
.BR lvmthin (7),
.BR lvmvdo (7),
.BR lvmautoactivation (7)

